#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/phytertek/gh-actions-demo/runs/run-5esGqna3AmAwVioX

Waiting for the plan to start...

Terraform v1.2.8
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.log-group will be created
  + resource "aws_cloudwatch_log_group" "log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "actions-tutorial-log-group"
      + retention_in_days = 0
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs-cluster will be created
  + resource "aws_ecs_cluster" "ecs-cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "actions-tutorial-ecs-cluster"
      + tags_all           = (known after apply)

      + configuration {
          + execute_command_configuration {
              + kms_key_id = (known after apply)
              + logging    = "OVERRIDE"

              + log_configuration {
                  + cloud_watch_encryption_enabled = true
                  + cloud_watch_log_group_name     = "actions-tutorial-log-group"
                }
            }
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_cluster_capacity_providers.ecs-capacity-providers will be created
  + resource "aws_ecs_cluster_capacity_providers" "ecs-capacity-providers" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "actions-tutorial-ecs-cluster"
      + id                 = (known after apply)
    }

  # aws_kms_key.kms-key will be created
  + resource "aws_kms_key" "kms-key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = (known after apply)
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @phyter1, Action: `pull_request`*